Revit 2027 API
RebarBendingDetailType.SegmentLengthDimensionsOffset Property
 Identifies the offset of the segment length dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SegmentLengthDimensionsOffset { get; set; }
Public Property SegmentLengthDimensionsOffset As Double
	Get
	Set
public:
property double SegmentLengthDimensionsOffset {
	double get ();
	void set (double value);
}
member SegmentLengthDimensionsOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for segmentLengthDimensionsOffset must be between 0 and 30000 feet.
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace